app/controllers/tickets_controller.rb

  def create
   #@ticket = Ticket.new(ticket_params)
   @ticket = current_user.tickets.build(ticket_params)

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("first_name", "last_name", "problem", "phone", "email", "SubmitTime", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @ticket.update(ticket_params)
---
UPDATE "tickets" SET "problem" = ?, "updated_at" = ? WHERE "tickets"."id" = ?

  def destroy
    @ticket.destroy
---
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 23]]

def correct_user
  @ticket = current_user.tickets.find_by(id: params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."user_id" = ? AND "tickets"."id" = ? LIMIT ?  [["user_id", 3], ["id", 23], ["LIMIT", 1]]